Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: See also dirname(), basename(), parse_url() and realpath().
pt_br: Veja também dirname(), basename(), parse_url() e realpath().

source: Closes a file pointer to a pipe opened by popen().
pt_br: Fecha um ponteiro de arquivo a uma pipe aberta por popen().

source: The file pointer must be valid, and must have been returned by a successful call to popen().
pt_br: O ponteiro de arquivo tem que ser válido e tem que ser retornado por uma chamada bem sucedida a função popen().

source: Returns the termination status of the process that was run.
pt_br: Retorna o status da finalização do processo que estava rodando.

source: See also popen().
pt_br: Veja também popen().

source: Example 1. pcntl_fork() Example
pt_br: Exemplo 1. pcntl_fork() Example

source: Example 1. pcntl_signal() Example
pt_br: Exemplo 1. pcntl_signal() Example

source: Table 1. possible values for pid
pt_br: Tabela 1. possible values for pid

source: Table 2. possible values for options
pt_br: Tabela 2. possible values for options

source: Returns the return code of a terminated child.
pt_br: Description

source: pdf_add_outline() is replaced by pdf_add_note()
pt_br: pdf_add_annotation - - Deprecated:

source: Deprecated.
pt_br: pdf_add_outline - - Deprecated:

source: See pdf_add_bookmark().
pt_br: Description

source: Add a new page to the document.
pt_br: Description

source: Print text at the next line.
pt_br: Description

source: Prepare a font for later use with pdf_setfont().
pt_br: Description

source: Example 1. pdf_findfont() example
pt_br: Exemplo 1. pdf_findfont() example

source: Get the contents of the PDF output buffer.
pt_br: Description

source: Set the current point.
pt_br: Description

source: The current point for graphics and the current text output position are maintained separately.
pt_br: Nota:

source: Create a new PDF file using the supplied file name.
pt_br: Description

source: pdf_open() is deprecated, use pdf_new() plus pdf_open_file() instead.
pt_br: Open a new pdf object

source: (PHP 3 CVS only, PHP 4)
pt_br: pdf_open_image_file

source: Open an image file.
pt_br: Description

source: Use image data from a variety of data sources.
pt_br: Description

source: Set the current color space and color.
pt_br: Description

source: See pdf_set_value().
pt_br: Description

source: You should use pdf_findfont() plus pdf_setfont() instead.
pt_br: Description

source: See also pdf_set_value(),
pt_br: Description

source: See pdf_set_paramter().
pt_br: pdf_set_text_matrix - - Deprecated:

source: See pdf_set_value(),
pt_br: Description

source: pfpro_init() is used to initialise the Payflow Pro library.
pt_br: Description

source: pg_affected_rows() returns the number of tuples (instances / records / rows) affected by INSERT, UPDATE, and DELETE queries executed by pg_query().
pt_br: pg_affected_rows() retorna o número de linhas (instâncias / registros / linhas) afetados por consultas (queries) INSERT, UPDATE e DELETE executados por pg_query().

source: If no tuple is affected by this function, it will return 0.
pt_br: Se nenhuma linha foi afetada, ela retornará 0.

source: Example 1. pg_affected_rows()
pt_br: Exemplo 1. pg_affected_rows()

source: ?php $result = pg_query ($conn, "INSERT INTO publisher VALUES ('Author')"); $cmdtuples = pg_affected_rows ($result); echo $cmdtuples. "tuples are affected .";?
pt_br: ?php $result = pg_query ($conn, "INSERT INTO publisher VALUES ('Author')"); $cmdtuples = pg_affected_rows ($result); echo $cmdtuples. "linhas foram afetadas .";?

source: This function used to be called pg_cmdtuples().
pt_br: Esta função costumava ser chamada de pg_cmdtuples().

source: See also pg_query() and pg_num_rows().
pt_br: Veja também pg_query() e pg_num_rows().

source: PostgreSQL functions
pt_br: Funções para PostgreSQL

source: pg_cancel_query() cancel asynchronous query sent by pg_send_query().
pt_br: pg_cancel_query() cancela uma consulta (query) assíncrona enviada por pg_send_query().

source: You cannot cancel query executed by pg_query().
pt_br: Você não pode cancelar uma consulta executada por pg_query().

source: See also pg_send_query() and pg_connection_busy()
pt_br: Veja também pg_send_query() e pg_connection_busy()

source: (PHP 3 CVS only, PHP 4 = 4.0.3)
pt_br: pg_client_encoding

source: pg_client_encoding() returns the client encoding as the string.
pt_br: Descrição

source: The returned string should be either:
pt_br: pg_client_encoding() retorna a codificação do cliente como uma string.

source: SQL_ASCII, EUC_JP, EUC_CN, EUC_KR, EUC_TW, UNICODE, MULE_INTERNAL, LATINX (X=1...9), KOI8, WIN, ALT, SJIS, BIG5, WIN1250.
pt_br: A string de retorno pode ser SQL_ASCII, EUC_JP, EUC_CN, EUC_KR, EUC_TW, UNICODE, MULE_INTERNAL, LATINX (X=1...9), KOI8, WIN, ALT, SJIS, BIG5, WIN1250.

source: If libpq is compiled without multibyte encoding support, pg_set_client_encoding() always return "SQL_ASCII ".
pt_br: Esta função requer PHP 4.0.3 ou maior e PostgreSQL 7.0 ou maior Se a libpq foi compilada sem suporte a codificação multibyte, pg_set_client_encoding() sempre retornará "SQL_ASCII ".

source: Supported encoding depends on PostgreSQL version.
pt_br: As codificações suportadas dependem da versão do PostgreSQL.

source: Refer to PostgreSQL manual for details to enable multibyte support and encoding supported.
pt_br: Vide o manual do PostgreSQL para mais detalhes sobre como habilitar o suporte a multibyte e outras codificações.

source: The function used to be called pg_clientencoding().
pt_br: Esta função costumava ser chamada pg_clientencoding().

source: See also pg_set_client_encoding().
pt_br: Veja também pg_set_client_encoding().

source: pg_close() closes the non-persistent connection to a PostgreSQL database associated with the given connection pg_close() closes the non-persistent connection to a PostgreSQL database associated with the given connection resource.
pt_br: pg_close() fecha a conexão não persistente com servidor de banco de dados PostgreSQL associado ao recurso (resource) connection dado.

source: Using pg_close() is not usually necessary, as non-persistent open connections are automatically closed at the end of the script.
pt_br: Normalmente, o uso de pg_close() não é necessário já que conexões não persistentes abertas são automaticamente fechadas ao final do processamento do script.

source: If there is open large object resource on the connection, do not close the connection before closing all large object resources.
pt_br: Se existem recursos (resource) de objetos grandes (large objects) abertos na conexão, não feche a conexão antes de fechar todos os recursos relacionados com estes objetos.

source: pg_connect() returns a connection resource that is needed by other PostgreSQL functions.
pt_br: pg_connect() retorna um recurso (resource) de conexão que é necessário para outras funções para PostgreSQL.

source: pg_connect() opens a connection to a PostgreSQL database specified by the connection_string.
pt_br: pg_connect() abre uma conexão com um servidor de banco de dados PostgreSQL especificado por connection_string.

source: It returns a connection resource on success.
pt_br: Retorna um recurso (resource) de conexão em caso de sucesso.

source: It returns FALSE if the connection could not be made. connection_string should be a quoted string.
pt_br: Retorna FALSE se a conexão não pôde ser estabelecida. connection_string deve ser uma string entre aspas duplas.

source: Using pg_connect
pt_br: Usando pg_connect

source: ?php $dbconn = pg_connect ("dbname=mary"); / /connect to a database named "mary "$dbconn2 = pg_connect ("host=localhost port=5432 dbname=mary"); / / connect to a database named "mary" on "localhost "at port "5432" $dbconn3 = pg_connect ("host=sheep port=5432 dbname=mary user=lamb password=foo"); / /connect to a database named "mary "on the host "sheep" with a username and password $conn_string = "host=sheep port=5432 dbname=test user=lamb password=bar"; $dbconn4 = pg_connect ($conn_string); / /connect to a database named "test "on the host "sheep" with a username and password?
pt_br: ?php $bdcon = pg_connect ("dbname=flavia"); / /conecta a um banco de dados chamado "flavia "$bdcon2 = pg_connect ("host=localhost port=5432 dbname=flavia"); / / conecta a um banco de dados chamado "flavia" em "localhost "na porta "5432" $bdcon3 = pg_connect ("host=ovelha port=5432 dbname=flavia user=ze password=buu"); / /conecta a um banco de dados chamado "flavia "na máquina "ovelha" com um usuário e senha $con_string = "host=ovelha port=5432 dbname=flavia user=ze password=buu"; $bdcon4 = pg_connect ($con_string); / /coneta a um banco de dados chamado "flavia "na máquina "ovelha" com um usuário e senha?

source: If a second call is made to pg_connect() with the same connection_string, no new connection will be established, but instead, the connection resource of the already opened connection will be returned.
pt_br: Se uma segunda chamada é feita para pg_connect() com a mesma connection_string, nenhuma nova conexão será estabelecida, ao invés disso, o recurso (resource) de conexão da conexão que já está aberta será retornado.

source: You can have multiple connections to the same database if you use different connection string.
pt_br: Você pode ter multiplas conexões para o mesmo banco de dados se você usar diferentes strings de conexão.

source: The old syntax with multiple parameters $conn = pg_connect ("host", "port", "options", "tty", "dbname") has been deprecated.
pt_br: A sintaxe antiga com parâmetros múltiplos $con = pg_connect ("host", "port", "options", "tty", "dbname") se tornou obsoleta.

source: See also pg_pconnect(), pg_close(), pg_host(), pg_port(), pg_tty(), pg_options() and pg_dbname().
pt_br: Veja também pg_pconnect(), pg_close(), pg_host(), pg_port(), pg_tty(), pg_options() e pg_dbname().

source: pg_connection_busy() returns TRUE if the connection is busy.
pt_br: pg_connection_busy() retorna TRUE se a conexão está ocupada.

source: If it is busy, a previous query is still executing.
pt_br: Se estiver ocupada, significa que uma consulta (query) anterior ainda está sendo executada.

source: If pg_get_result() is called, it will be blocked.
pt_br: Se pg_get_result() for chamada, será bloqueada.

source: See also pg_connection_status() and pg_get_result()
pt_br: Veja também pg_connection_status() e pg_get_result()

source: pg_connection_reset() resets the connection.
pt_br: Descrição

source: It is useful for error recovery.
pt_br: pg_connection_reset() reinicia uma conexão.

source: See also pg_connect(), pg_pconnect() and pg_connection_status()
pt_br: Veja também pg_connect(), pg_pconnect() e pg_connection_status()

source: pg_connection_status() returns a connection status.
pt_br: Descrição

source: Possible statuses are PGSQL_CONNECTION_OK and PGSQL_CONNECTION_BAD.
pt_br: Os status possíveis são PGSQL_CONNECTION_OK e PGSQL_CONNECTION_BAD.

source: See also pg_connection_busy().
pt_br: Veja também pg_connection_busy().

source: pg_convert() check and convert assoc_array suitable for SQL statement.
pt_br: pg_convert() checa e converte assoc_array em uma declaração SQL apropriada.

source: This function is experimental.
pt_br: Esta função é experimental.

source: See also pg_metadata()
pt_br: Veja também pg_metadata()

source: pg_copy_from() insert records into a table from rows.
pt_br: Descrição

source: It issues COPY FROM SQL command internally to insert records.
pt_br: Usa o comando interno COPY FROM para inserir registros.

source: See also pg_copy_to()
pt_br: Veja também pg_copy_to()

source: pg_copy_to() copies a table to an array.
pt_br: Descrição

source: It issues COPY TO SQL command internally to insert records.
pt_br: Utiliza internamente o comando SQL COPY TO para inserir os registros.

source: The resulting array is returned.
pt_br: Seu retorno é o array resultante.

source: It returns FALSE on failure.
pt_br: Caso haja falhas, FALSE é retornado.

source: See also pg_copy_from()
pt_br: Veja também pg_copy_from()

source: pg_dbname() returns the name of the database that the given PostgreSQL connection resource.
pt_br: pg_dbname() retorna o nome do banco de dados para um dado recurso (resource) de conexão connection.

source: It returns FALSE, if connection is not a valid PostgreSQL connection resource.
pt_br: Retorna FALSE, se connection não é um recurso de conexão PostgreSQL válido.

source: pg_delete() deletes record condition specified by assoc_array which has field= value.
pt_br: pg_delete() remove registros que seguem a condição especificada por assoc_array que tem o formato campo = valor.

source: If option is specified, pg_convert() is applied to assoc_array with specified option.
pt_br: Se options for especificado, pg_convert() é aplicada a assoc_array com a opção especificada.

source: Example 1. pg_delete
pt_br: Exemplo 1. pg_delete

source: ?php $db = pg_connect ('dbname=foo'); / / This is safe, since $_POST is converted automatically $res = pg_delete($db, 'post_log', $_POST); if ($res) {echo "POST data is deleted: $res\n";} else {echo "User must have sent wrong inputs\n";}?
pt_br: ?php $db = pg_connect ('dbname=flavia'); / / Isto é seguro, já que $_POST é convertido automaticamente $res = pg_delete($db, 'post_log', $_POST); if ($res) {echo "Dados de POST foram removidos: $res\n";} else {echo "O usuário deve ter enviado parâmetros inválidos\n";}?

source: See also pg_convert()
pt_br: Veja também pg_convert()

source: pg_end_copy() syncs the PostgreSQL frontend (usually a web server process) with the PostgreSQL server after doing a copy operation performed by pg_put_line(). pg_end_copy() pg_end_copy() syncs the PostgreSQL frontend (usually a web server process) with the PostgreSQL server after doing a copy operation performed by pg_put_line(). pg_end_copy() must be issued, otherwise the PostgreSQL server may get out of sync with the frontend and will report an error.
pt_br: pg_end_copy() sincroniza o frontend PostgreSQL (geralmente um processo de servidor HTTP) com o servidor PostgreSQL depois de fazer uma operação de cópia usando pg_put_line(). pg_end_copy() deve ser chamada, caso contrário o servidor PostgreSQL pode perder a sincronia com o frontend fazendo com que o servidor gere um erro.

source: For further details and an example, see also pg_put_line().
pt_br: Para maiores detalhes e um exemplo, veja também pg_put_line().

source: pg_escape_bytea() escapes string for bytea datatype.
pt_br: pg_escape_bytea() gera uma string do tipo bytea.

source: It returns escaped string.
pt_br: Retorna uma string com escapes.

source: When you SELECT bytea type, PostgreSQL returns octal byte value prefixed by\ (e.g. \032).
pt_br: Quando você usa SELECT bytea type, o PostgreSQL retorna valores de byte octais prefixados por\ (ex.: \032).

source: Users are supposed to convert back to binary format by yourself.
pt_br: Usuários devem converter de volta para binários por si mesmos.

source: This function requires PostgreSQL 7.2 or later.
pt_br: Esta função exige PostgreSQL 7.2 ou superior.

source: With PostgreSQL 7.2.0 and 7.2.1, bytea type must be casted when you enable multi-byte support. i.e.
pt_br: Com PostgreSQL 7.2.0 e 7.2.1, o tipo de dados bytea deve ser criado quando você habilita o suporte a multi-byte.

source: INSERT INTO test_table (image) VALUES ('$image_escaped'::bytea); PostgreSQL 7.2.2 or later does not need cast.
pt_br: Por exemplo, INSERT INTO tabela_teste (imagem) VALUES ('$imagem_escaped'::bytea); Por exemplo, INSERT INTO tabela_teste (imagem) VALUES ('$imagem_escaped'::bytea); PostgreSQL 7.2.2 ou superior não precisa de coerção (cast).

source: Exception is when client and backend character encoding does not match, there may be multi-byte stream error.
pt_br: A exceção é quando a codificação de caracteres do cliente e do backend não combinam, então pode haver erro de fluxo de multi-byte.

source: User must cast to bytea to avoid this error.
pt_br: O usuário deve fazer a coerção (cast) para bytea para evitar este erro.

source: Newer PostgreSQL will support unescape function.
pt_br: Versões do PostgreSQL mais novas suportarão a função unescape.

source: Support for built-in unescape function will be added when it 's available.
pt_br: Suporte para a função interna unescape será adicionada assim que estiver disponível.

source: See also pg_escape_string()
pt_br: Veja também pg_escape_string()

source: pg_escape_string() escapes string for text / char datatype.
pt_br: pg_escape_string() gera strings do tipo text / chat.

source: It returns escaped string for PostgreSQL.
pt_br: Retorna uma string com escapes para PostgreSQL.

source: Use of this function is recommended instead of addslashes().
pt_br: O uso desta função é recomendado no lugar de addslashes().

source: See also pg_escape_bytea()
pt_br: Veja também pg_escape_bytea()

source: pg_fetch_all() returns an array that contains all row (tuples / records) in result resource.
pt_br: pg_fetch_all() retorna uma array que contém todas as linhas (registros) do recurso (resourse) de resultado.

source: It returns FALSE, if there are no more rows.
pt_br: Retorna FALSE, se não existem mais registros.

source: See also pg_fetch_row(), pg_fetch_array(), pg_fetch_object() and pg_fetch_result().
pt_br: Veja também pg_fetch_row(), pg_fetch_array(), pg_fetch_object() e pg_fetch_result().

source: PostgreSQL fetch array
pt_br: Retornando linhas (registros) no PostgreSQL

source: ?php $conn = pg_pconnect ("dbname=publisher"); if (!$conn) {echo "An error occured.\n"; exit;} $result = pg_query ($conn, "SELECT * FROM authors"); if (!$result) {echo "An error occured.\n"; exit;} $arr = pg_fetch_all ($result, 0, PGSQL_NUM); var_dump($arr);?
pt_br: ?php $conn = pg_pconnect ("dbname=escritor"); if (!$conn) {echo "Ocorreu um erro!\n"; exit;} $result = pg_query ($conn, "SELECT * FROM authors"); if (!$result) {echo "Ocorreu um erro!\n"; exit;} $arr = pg_fetch_all ($result, 0, PGSQL_NUM); var_dump($arr);?

source: pg_fetch_array() returns an array that corresponds to the fetched row (tuples / records).
pt_br: pg_fetch_array() retorna um array que corresponde à linha (registro).

source: pg_fetch_array() is an extended version of pg_fetch_row().
pt_br: pg_fetch_array() é uma versão extendida de pg_fetch_row().

source: In addition to storing the data in the numeric indices (field index) to the result array, it also stores the data in associative indices (field name) by default.
pt_br: Além de armazenar os dados em índices numéricos (índice) no array resultante, também armazena os dados em chaves associativas (nome do campo) por padrão.

source: row is row (record) number to be retrieved.
pt_br: row é o número da linha (registro) a ser recuperado.

source: First row is 0.
pt_br: A primeira linha é 0.

source: result_type is optional parameter controls how return value is initialized. result_type is a constant and can take the following values:
pt_br: result_type é um parâmetro opcional que controla como o valor de retorno é iniciado. result_type é uma constante e pode ter os seguintes valores:

source: PGSQL_ASSOC, PGSQL_NUM, and PGSQL_BOTH. pg_fetch_array() PGSQL_ASSOC, PGSQL_NUM, and PGSQL_BOTH. pg_fetch_array() returns associative array that has field name as key for PGSQL_ASSOC. field index as key with PGSQL_NUM and both field name / index as key with PGSQL_BOTH.
pt_br: Índice de campo como chave com PGSQL_NUM e ambos nome / índice numérico como chave com PGSQL_BOTH.

source: Default is PGSQL_BOTH.
pt_br: Nota:

source: pg_fetch_array() is NOT significantly slower than using pg_fetch_row(), while it provides a significant ease of use.
pt_br: pg_fetch_array() NÃO é significativamente mais lenta que pg_fetch_row(), e ainda fornece uma significativa facilidade de uso.

source: See also pg_fetch_row() and pg_fetch_object() and pg_fetch_result().
pt_br: Veja também pg_fetch_row(), pg_fetch_object() e pg_fetch_result().

source: ?php $conn = pg_pconnect ("dbname=publisher"); if (!$conn) {echo "An error occured.\n"; exit;} $result = pg_query ($conn, "SELECT * FROM authors"); if (!$result) {echo "An error occured.\n"; exit;} $arr = pg_fetch_array ($result, 0, PGSQL_NUM); echo $arr[0]. "- array\n"; $arr = pg_fetch_array ($result, 1, PGSQL_ASSOC); echo $arr["author"]." - array\n";?
pt_br: ?php $conn = pg_pconnect ("dbname=publicar"); if (!$conn) {echo "Um erro ocorreu.\n"; exit;} $result = pg_query ($conn, "SELECT * FROM autores"); if (!$result) {echo "Um erro ororreu.\n"; exit;} $arr = pg_fetch_array ($result, 0, PGSQL_NUM); echo $arr[0]. "- array\n"; $arr = pg_fetch_array ($result, 1, PGSQL_ASSOC); echo $arr["autor"]." - array\n";?

source: From 4.1.0, row became optional.
pt_br: A partir do PHP 4.1.0, row tornou-se opcional.

source: Calling pg_fetch_array() will increment internal row counter by 1.
pt_br: A chamada pg_fetch_array() irá incrementar o contador de linha interno em 1.

source: pg_fetch_assoc() returns an associative array that corresponds to the fetched row (tuples / records).
pt_br: pg_fetch_assoc() retorna um array associativo que corresponde à linha (registro) recuperado.

source: pg_fetch_assoc() is an extended version of pg_fetch_row().
pt_br: pg_fetch_assoc() é uma versão extendida de pg_fetch_row().

source: pg_fetch_assoc() is NOT significantly slower than using pg_fetch_row(), while it provides a significant ease of use.
pt_br: pg_fetch_assoc() NÃO é significativamente mais lenta que pg_fetch_row(), e ainda fornece uma significativa facilidade de uso.

source: See also pg_fetch_row(), pg_fetch_array(), pg_fetch_assoc(), pg_fetch_object() and pg_fetch_result().
pt_br: Veja também pg_fetch_row(), pg_fetch_array(), pg_fetch_object() e pg_fetch_result().

source: ?php $conn = pg_pconnect ("dbname=publisher"); if (!$conn) {echo "An error occured.\n"; exit;} $result = pg_query ($conn, "SELECT * FROM authors"); if (!$result) {echo "An error occured.\n"; exit;} $arr = pg_fetch_assoc ($result, 1, PGSQL_ASSOC); echo $arr["author"]. "- array\n";?
pt_br: ?php $conn = pg_pconnect ("dbname=revista"); if (!$conn) {echo "Ocorreu um erro.\n"; exit;} $result = pg_query ($conn, "SELECT * FROM authors"); if (!$result) {echo "Ocorreu um erro.\n"; exit;} $arr = pg_fetch_assoc ($result, 1, PGSQL_ASSOC); echo $arr["author"]. "- array\n";?

source: pg_fetch_object() returns an object with properties that correspond to the fetched row.
pt_br: pg_fetch_object() retorna um objeto com propriedades que correspondem à linha recuperada.

source: It returns FALSE if there are no more rows or error.
pt_br: Retorna FALSE se não existem mais linhas ou no caso de erro.

source: pg_fetch_object() is similar to pg_fetch_array(), with one difference - an object is returned, instead of an array.
pt_br: pg_fetch_object() é similar a pg_fetch_array(), com uma diferença - um objeto é retornado, ao invés de um array.

source: Speed-wise, the function is identical to pg_fetch_array(), and almost as quick as pg_fetch_row() (the difference is insignificant).
pt_br: Em termos de performance, a função é idêntica a pg_fetch_array(), e quase tão rápida quanto pg_fetch_row() (a diferença é insignificante).

source: From 4.1.0, row is optional.
pt_br: A partir do PHP 4.1.0, row é opcional.

source: From 4.3.0, result_type is default to PGSQL_ASSOC while older versions' default was PGSQL_BOTH.
pt_br: A partir do PHP 4.3.0, result_type tem PGSQL_ASSOC como valor padrão, enquanto em outras versões mais antigas o padrão é PGSQL_BOTH.

source: There is no use for numeric property, since numeric property name is invalid in PHP.
pt_br: Não há utilidade para a propriedade numérica, já que nomes de propriedades numéricas são inválidas em PHP.

source: result_type may be deleted in future versions.
pt_br: O parâmetro result_type deverá ser removido em versões futuras.
